# Customer Segmentation

## Importing Libraries

In [1]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt
import seaborn as sns

## Data Collection

In [14]:
train = pd.read_csv('C:/Users/kumar/OneDrive/Desktop/Machine Learning Project/datasets/customer segmentation/Train.csv')
test=pd.read_csv('C:/Users/kumar/OneDrive/Desktop/Machine Learning Project/datasets/customer segmentation/Test.csv')
print(train.shape, "  ",test.shape)

(8068, 11)    (2627, 10)

In [15]:
test['Segmentation'] = np.nan
df = pd.concat([train, test], ignore_index=True)
df.shape

(10695, 11)

In [16]:
df.head()

,ID,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1,Segmentation
0,462809,Male,No,22,No,Healthcare,1.0,Low,4.0,Cat_4,D
1,462643,Female,Yes,38,Yes,Engineer,NaN,Average,3.0,Cat_4,A
2,466315,Female,Yes,67,Yes,Engineer,1.0,Low,1.0,Cat_6,B
3,461735,Male,Yes,67,Yes,Lawyer,0.0,High,2.0,Cat_6,B
4,462669,Female,Yes,40,Yes,Entertainment,NaN,High,6.0,Cat_6,A

In [17]:
df.tail()

,ID,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1,Segmentation
10690,467954,Male,No,29,No,Healthcare,9.0,Low,4.0,Cat_6,NaN
10691,467958,Female,No,35,Yes,Doctor,1.0,Low,1.0,Cat_6,NaN
10692,467960,Female,No,53,Yes,Entertainment,NaN,Low,2.0,Cat_6,NaN
10693,467961,Male,Yes,47,Yes,Executive,1.0,High,5.0,Cat_4,NaN
10694,467968,Female,No,43,Yes,Healthcare,9.0,Low,3.0,Cat_7,NaN

## Data Preprocessing

## Training Model

## Evaluation